In [1]:
import pandas as pd
import constants

In [5]:
df_features = pd.read_csv(constants.FEATURES_PATH)

In [6]:
df_features.shape

(5000000, 21)

In [7]:
df_features.head()

,id,age,gender,income,education,marital_status,occupation,city,state,children,...,car_owner,credit_score,internet_usage,exercise_frequency,smoker,alcohol_consumption,diet,pet_owner,travel_frequency,hobbies
0,1,31,Male,82348,Masters,Divorced,Teacher,Los Angeles,AZ,3,...,False,393,0,4,True,Moderate,Vegetarian,False,Rarely,Cooking
1,2,37,Male,54495,Bachelors,Divorced,Artist,Chicago,IL,1,...,False,579,2,6,False,NaN,Vegan,False,Never,Sports
2,3,68,Male,101626,Masters,Divorced,Doctor,Los Angeles,CA,4,...,True,746,21,3,True,Heavy,Non-Vegetarian,True,Often,Reading
3,4,41,Male,134833,Bachelors,Widowed,Artist,Phoenix,AZ,3,...,True,596,9,1,False,Moderate,Vegan,True,Often,Traveling
4,5,32,Male,43344,High School,Married,Doctor,Houston,TX,3,...,False,687,9,0,True,Heavy,Vegan,True,Never,Music

In [8]:
df_known_target = pd.read_csv(constants.TARGET_KNOWN_PATH)

In [9]:
df_known_target.shape

(4500000, 2)

In [10]:
df_known_target.head()

   id  income
0   1   17494
1   2   11320
2   3   39260
3   4   19628
4   5   34839